{
  "products": [
    {
      "id": "1",
      "title": "Cama Box Colchão Queen",
      "image": "/images/bed.jpg",
      "price": 1290.9,
      "description": "Cama box tamanho queen com colchão incluso, ideal para conforto e praticidade no quarto. Estrutura reforçada, tecido de alta qualidade e acabamento premium garantem durabilidade e elegância. O colchão possui tecnologia de molas ensacadas, proporcionando noites de sono tranquilas e suporte adequado para a coluna. Fácil de montar e perfeita para quem busca otimizar o espaço sem abrir mão do conforto."
    },
    {
      "id": "2",
      "title": "Sofá Retrátil 3 Lugares",
      "image": "/images/couch2.jpg",
      "price": 1899.99,
      "description": "Sofá retrátil para 3 pessoas, perfeito para salas de estar modernas e aconchegantes. Possui assentos extensíveis e encostos reclináveis, permitindo diferentes configurações para relaxar ou receber visitas. O revestimento em tecido resistente e fácil de limpar, aliado à espuma de alta densidade, oferece conforto e praticidade no dia a dia. Design contemporâneo que valoriza qualquer ambiente."
    },
    {
      "id": "3",
      "title": "Mesa de Jantar",
      "image": "/images/table.jpg",
      "price": 799.5,
      "description": "Mesa de jantar com 4 cadeiras, ideal para famílias e reuniões. O design moderno e a madeira maciça proporcionam durabilidade e elegância. A estrutura é reforçada para suportar o uso diário, enquanto o revestimento em tecido macio e resistente oferece conforto e praticidade. Fácil de limpar e combinar com diversos estilos de decoração."
    },
    {
      "id": "4",
      "title": "Cama Casal Estofada",
      "image": "/images/bed2.jpg",
      "price": 999,
      "description": "Cama de casal com estrutura estofada, proporcionando conforto e elegância ao ambiente. O estofamento em tecido macio e resistente oferece um toque sofisticado, enquanto a cabeceira alta garante apoio extra para leitura ou descanso. Estrutura interna de madeira de reflorestamento, sustentável e durável. Ideal para quem busca unir estilo e funcionalidade no quarto."
    },
    {
      "id": "5",
      "title": "Sofá 2 Lugares Compacto",
      "image": "/images/couch.jpg",
      "price": 1290,
      "description": "Sofá compacto para 2 lugares, ideal para ambientes pequenos e funcionais. Seu design minimalista se adapta facilmente a diferentes estilos de decoração, enquanto o assento e encosto acolchoados garantem conforto mesmo em espaços reduzidos. Estrutura leve, fácil de transportar e montar, perfeito para apartamentos, escritórios ou quartos."
    },
    {
      "id": "6",
      "title": "Escrivaninha Madeira",
      "image": "/images/desk.jpg",
      "price": 2490,
      "description": "Escrivaninha de madeira maciça, ideal para escritórios ou áreas de convivência. O design clássico e a madeira natural proporcionam durabilidade e elegância. A estrutura é reforçada para suportar o uso diário, enquanto o revestimento em tecido macio e resistente oferece conforto e praticidade. Fácil de montar e combinar com diversos estilos de decoração."
    },
    {
      "id": "7",
      "title": "Guarda-Roupa Espelhado",
      "image": "/images/wardrobe.jpg",
      "price": 2090,
      "description": "Guarda-roupa 3 portas com espelho, ideal para quartos. O design moderno e a madeira natural proporcionam durabilidade e elegância. A estrutura é reforçada para suportar o uso diário, enquanto o revestimento em tecido macio e resistente oferece conforto e praticidade. Fácil de montar e combinar com diversos estilos de decoração."
    },
    {
      "id": "8",
      "title": "Poltrona Reclinável Luxo",
      "image": "/images/armchair.jpg",
      "price": 1599.99,
      "description": "Poltrona reclinável com design ergonômico e acabamento premium. Ideal para leitura, descanso ou assistir TV, possui mecanismo de reclinação suave e apoio para os pés. Estofamento em tecido macio, estrutura reforçada e fácil de limpar. Um toque de conforto e elegância para qualquer ambiente."
    },
    {
      "id": "9",
      "title": "Cama Solteiro",
      "image": "/images/bed3.jpg",
      "price": 1290,
      "description": "Cama solteiro com estrutura de madeira maciça, ideal para quartos juvenis ou de hóspedes. O design clássico e a madeira natural proporcionam durabilidade e elegância. A estrutura é reforçada para suportar o uso diário, enquanto o revestimento em tecido macio e resistente oferece conforto e praticidade. Fácil de montar e combinar com diversos estilos de decoração."
    },
    {
      "id": "10",
      "title": "Rack de TV",
      "image": "/images/rack.jpg",
      "price": 1180,
      "description": "Rack para sala de estar com 3 portas, ideal para guardar televisão e outros itens. O design moderno e a madeira natural proporcionam durabilidade e elegância. A estrutura é reforçada para suportar o uso diário, enquanto o revestimento em tecido macio e resistente oferece conforto e praticidade. Fácil de montar e combinar com diversos estilos de decoração."
    }
  ],
  "cart": [
    {
      "id": "3766",
      "productId": "5",
      "quantity": 2
    }
  ]
}